Revit 2026 API

# FaceArrayIsEmpty Property

---

Test to see if the array is empty.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool IsEmpty { get; }
```
```vb
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
```
```cpp
public:
virtual property bool IsEmpty {
	bool get ();
}
```
```fsharp
abstract IsEmpty : bool with get
override IsEmpty : bool with get
```

#### Property Value

Boolean

If the array is empty then True will be returned, otherwise False.

#### Reference

FaceArray Class

Autodesk.Revit.DB Namespace